# LoadMomentMx1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadMomentMx1 Property
ParameterTypeId Class See Also
---
"Mx 1"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadMomentMx1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadMomentMx1 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadMomentMx1 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace